This notebook explores a new source of information we need to work through for the "Assessment Analytical Framework" we are developing to support mineral resource assessments in the USGS. The framework consists of various technologies designed to produce analysis-ready data for the assessment process. A big part of that is the development of workflows, as automated as possible, that pull source data and information and "mobilize" them up for use.

For many years, we've been collecting and working with a type of technical report required of mining companies based in Canada (NI 43-101 Technical Report) as a source for mineral deposit type information and other geoscientific details. The Securities and Exchange Commission (SEC) in the U.S. now also [requires this type of information](https://www.sec.gov/corpfin/secg-modernization-property-disclosures-mining-registrants) to be filed as a regular submission from any publicly traded mining companies in the U.S. Similar to the NI 43-101 Reports that we have assembled for use in a Zotero collection, we also need to start pulling and organizing the  S-K 1300 Technical Reports required by the SEC. All of the same basic requirements apply:

* Provide an online locale for the reports that is easily accessible and manageable by assessment geologists and science support staff
* Provide for consistent, publicly citable references in reports and articles, including ensuring long-term viability of the citable references
* Provide a mechanism for routine annotation of reports by assessment geologists and science support staff
* Provide a means for the report contents to be fed into AI/ML pipelines for further processing to identify/link entities (mineral deposit sites, etc.) and automate aspects of turning information into analyzable data

As an improvement over the situation with the [SEDAR](https://www.sedar.com/) source for NI 43-101 Reports where we have a web site expressly protected against robot interfaces, the SEC's EDGAR platform provides some decent [direct data interfaces](https://www.sec.gov/edgar/sec-api-documentation) to support automated retrieval of the company submissions we are interested in. Data from the SEC is of great interest in a lot of different circumstances, and their data handling and availability seems to be subsequently quite mature.

Our initial starting point is likely the set of two bulk data downloads compiled nightly. Both of these are zip files with JSON documents for each unique identified company over which the SEC exercises regulatory authority. One of these contains a set of "company facts," and the other lists the submissions the companies have filed with the SEC (which should include the S-K 1300 Technical Reports).

Many times, bulk downloads are a much better starting point or even long-term source for data from an origin point like this. They give us a big tranche of data that we have to download initially and spin up into some kind of our own data infrastructure for use, but they help us avoid a number of problems that can arise when trying to operate against what are often purpose-built APIs that may be less than fully stable or may not provide the most efficient means for us to obtain the answers we want. In this case as with many others, we really only want a small slice of what the overall source contains (the SEC regulates many companies, only some of which are involved in mining).

After working through the two collections of bulk download files in previous versions of this notebook, we really only need to focus on the submissions data. These files give us useful details about the companies regulated by the SEC, including a code we can use to identify companies involved in mining, along with the filings the companies have made, which will include our target documents. We'll be setting up a data processing workflow that will involve the following steps:

1. Download and unzip the submissions bulk download (likely to S3 storage). We'll store everything initially but expunge records (JSON documents) for non-mining companies once we tease those out. The bucket containing individual company submission JSON source files can be versioned so that new versions of documents (they are file-named with the CIK identifier) trigger processing. In steps 2 and 3, we build a database from the extracted parts of these records that are important to us.
2. Work through all submissions files using the Standard Industrial Classification (SIC) code to identify mining-related companies and store basic company details in a registry (database). Once this is done once, we can shift to a lighter weight regular process of using the Central Index Key (CIK) identifiers in checking the submissions for updates as opposed to needing to work through the entire set of records. We will put a process in place to periodically check for new mining companies to add to our registry.
3. Within the submissions files for each company, there are records for "10-K Annual Filings." These are the submissions that contain S-K 1300 Technical Reports when those are available. We have to first identify all 10-K annual filings and then run a separate process to examine two HTML pages associated with the archive accession numbers for the filings. From these, we get identifiers, titles, and links for the technical reports themselves. We'll create another data store for the basic information on annual reports and technical reports from this process so we have an overall inventory of what we're going after, and then have a process that retieves and stores the files.
4. The inventory of technical reports data store will give us titles, dates, and provenance information that we can use to stup out bibliographic records. Once files are retrieved, we can have another process that writes bibliographic metadata and file content to a Zotero group library for the S-K 1300 reports. This will put them in the same infrastructure as the NI 43-101 Technical Reports, allowing us to feed them into xDD and other processing as well as using them as citable references in assessments.

The newer version of the code notebook below works through the logic in these steps with a start to the functional code we'll build into a package and then automate. I'm shifting development work to the USGS CHS Pangeo environment where we are able to work on CHS resources in the us-west-2 region.

## Note on Company Facts
There are potentially interesting details in the "company facts" data that we could reexamine at a later time. There are many accounting details, including some attributes specific to mining such as the expense outlays on mining equipment and mineral revenues. Once the registry of mining companies and their associated identifiers are in place, we could build another process to periodically pull company facts and extract out the interesting bits we'd want to use in analyses.

In [ ]:
!pip install awswrangler html5lib

In [1]:
import json
from glob import glob
import pandas as pd
import requests
import io
import zipfile
from bs4 import BeautifulSoup
import boto3
import awswrangler as wr
import os
import json
from pathlib import Path
import time

# Establish AWS Connection

In order to work with anything in AWS, we have to have an authenticated session that picks up and establishes roles for access that are authorized to do certain things. When we build this out as an automated process, we'll be operating the code as a Lambda or container application on AWS through which a role will be established specific to that process. For development and testing purposes, we need to use our own authenticated access tied to our login. CHS policy has limited this type of access to using SAML with Active Directory credentials that can only be established when connected to the network. In order to work with this from the Pangeo environment, I've worked up a process whereby I authenticate from my local workstation and then upload the necessary token information that is generated by that process. This is a temporary set of tokens that only last for a session duration (8 hours) and then must be refreshed.

When operating this notebook from the CHS Pangeo environment, the environment it is running in has a connection established to CHS with a role that has access to certain resources. We need to establish a different session using our own credentials in order to work with the AWS resources we are using for this exercise. The following functions check the file with our temporary cache of tokens, sets those as environment variables if necessary, and then uses those to establish a session using the Python Boto3 package. We establish this as a variable and then use it in our connections.

In [2]:
def set_env():
    home = str(Path.home())
    env_json_path = f"{home}/.aws/env.json"

    if "AWS_ACCESS_KEY_ID" in os.environ:
        print("Required environment variables set.")
        return True

    print("Required environment variables not set. Attempting to read from file.")
    
    if os.path.exists(env_json_path):
        env = json.load(open(env_json_path, "r"))
        for k,v in env.items():
            os.environ[k] = str(v)
        return True
    else:
        print(f"Required file with environment variables not available: {env_json_path}")
        return False

def boto3_session():
    if set_env():
        session = boto3.Session(
            aws_access_key_id=os.environ["AWS_ACCESS_KEY_ID"],
            aws_secret_access_key=os.environ["AWS_SECRET_ACCESS_KEY"],
            aws_session_token=os.environ["AWS_SESSION_TOKEN"]
        )
        return session

# Interacting with SEC EDGAR
Much of the SEC EDGAR system is designed to be crawled by "polite bots" that declare themselves appropriately. We need to send a user agent string that lets the SEC system know who we are. Otherwise, they will pick up that we're coming from a script and block our access. We're also limited to 10 requests per second when we need to go after information in bulk.

In [3]:
user_agent = "US Geological Survey;https://www.usgs.gov/"

In [4]:
aws_session = boto3_session()

Required environment variables not set. Attempting to read from file.

# Mining Company Registry
In order to identify and download the S-K 1300 Technical Reports on individual mining properties, we have to essentially crawl the appropriate SEC filings (10-K annual reports), pick out the technical reports included in those accessions, and put a couple pieces of information together. To to do that effectively over time and at scale, we need to hone in on the mining companies and those involved in mining who will be filing these particular reports. To do that, we need to build our own registry of mining companies and their associated CIK identifiers.

After initially struggling through trying to download and work with the full tranche of bulk submissions data (all 815K JSON files), I ended up writing a scraping routine to use one of the EDGAR search interfaces that allows for a search on Standard Industrial Classification (SIC) code. I could not find any equivalent API method that would let me exercise this search option. This lets us immediately hone in on just those companies that should be "mining registrants" from the SEC's definition and likely to have S-K 1300 Technical Reports. It also provides a reasonably efficient route to check for new companies classified this way that we will want to add to our registry.

## 1) Get Mining Companies via Search
The search interface is accessible via URL patterns like the following...

https://www.sec.gov/cgi-bin/browse-edgar?action=getcompany&SIC=1000&owner=include&match=&start=0&count=100&hidefilings=0

...where the SIC code comes from this [table](https://www.sec.gov/corpfin/division-of-corporation-finance-standard-industrial-classification-sic-code-list). We can loop through results 100 at a time, setting the start value in the URL to increment appropriately, processing the table of results to a dataframe, and then concatenating all together to give us one table of the CIK identifiers and names for entities we think are probably mining companies that may have to file technical reports. We can then use this to incrementally retrieve and store a few additional details about the companies and the list of all their recent submissions/filings to the SEC. From the filings, we'll be able to focus on the 10-K annual reports where we can check for S-K 1300 Technical Report exhibits.

The cache_edgar_cik_submissions() function is the main work horse here. It exercises the same slowed process to work in keeping with throttle limits the SEC puts on their server, retrieves the JSON representation for a given CIK value, and does some minimal processing to produce and cache parquet files, one for the company properties that might be useful and one for the submissions. We can then put these together to produce individual combined datasets or otherwise use them as the start to our registry. The function will respond to a list of CIKs or a single identifier, so it can be used in a variety of ways to fill in blanks for update everything.

In [114]:
def sec_companies_by_sic(sic_codes):
    company_results = []

    for sic in sic_codes:
        table_in_result = True
        start = 0
        while table_in_result:
            search_url = f"https://www.sec.gov/cgi-bin/browse-edgar?action=getcompany&SIC={sic}&owner=include&match=&start={start}&count=100&hidefilings=0"
            r = requests.get(search_url, headers={"User-Agent": user_agent})
            if r.status_code != 200:
                table_in_result = False
            search_results = io.BytesIO(r.content)
            try:
                search_tables = pd.read_html(io=search_results)
            except Exception as e:
                table_in_result = False
            company_results.append(search_tables[0])
            start = start + 100
            time.sleep(0.1)

    df_companies = pd.concat(company_results)
    
    return df_companies

def cik_str(cik_id, prefix="CIK"):
    """
    Simple function to transform an SEC EDGAR CIK identifier into a string.
    """
    padded_id = str(cik_id).zfill(10)
    return prefix + padded_id

def cik_data_files(
    cik_id, 
    source_type="companyfacts", 
    source_path="/home/skybristol/experiments/data/sec_edgar"
):
    cik_id_str = cik_str(cik_id)
    data_files = glob("/".join([source_path, source_type, cik_id_str + "*"]))
    return data_files

def load_data_file(path=None, cik_id=None, source_type=None):
    if path is not None:
        return json.load(open(path, "r"))
    
    if cik_id is not None:
        return [json.load(open(p, "r")) for p in cik_data_files(cik_id, source_type)]
    
def cache_edgar_cik_submissions(cik, user_agent, cache_path=None, boto3_session=None):
    if not isinstance(cik, list) and isinstance(cik, str):
        cik = [cik]
        
    for cik_str in cik:
        source_path = f"https://data.sec.gov/submissions/{cik_str}.json"
        
        r = requests.get(source_path, headers={"User-Agent": user_agent})
        if r.status_code != 200:
            print("Problem retrieving URL", source_path, r.status_code)
        else:
            submissions = r.json()
            basic_company_props = {k:v for k,v in submissions.items() if k in [
                "cik",
                "entityType",
                "sic",
                "sicDescription",
                "name",
                "ein",
                "description",
                "website",
                "category",
                "stateOfIncorporation"
            ]}
            df_company = pd.DataFrame([basic_company_props])
            if "filings" in submissions and "recent" in submissions["filings"] and isinstance(submissions["filings"]["recent"], dict):
                df_filings = pd.DataFrame(submissions["filings"]["recent"])
                df_filings["cik"] = df_company.loc[0].cik
            else:
                df_filings = None
                
            if cache_path is not None:
                if not df_company.empty:
                    wr.s3.to_parquet(
                        df=df_company,
                        path=f"{cache_path}/{cik_str}_company.parquet",
                        boto3_session=boto3_session
                    )
                if df_filings is not None and not df_filings.empty:
                    wr.s3.to_parquet(
                        df=df_filings,
                        path=f"{cache_path}/{cik_str}_filings.parquet",
                        boto3_session=boto3_session
                    )

        time.sleep(0.1)
        
def accession_file_manifest(df, user_agent, cache_path=None, boto3_session=None):
    for index, row in df.iterrows():
        file_manifest = f"https://www.sec.gov/Archives/edgar/data/{row.cik_str}/{row.accessionNumber.replace('-','')}/index.json"
        r = requests.get(file_manifest, headers={"User-Agent": user_agent})
        if r.status_code != 200:
            print("Problem retrieving URL", file_manifest, r.status_code)
        else:
            file_list = r.json()
            df_files = pd.DataFrame(file_list["directory"]["item"])
            df_files["url"] = df_files["name"].apply(lambda x: f"https://www.sec.gov{file_list['directory']['name']}/{x}")
            df_files["type"] = df_files["name"].apply(lambda x: "S-K 1300 Technical Report" if "ex96" in x else None)
            df_files["cik"] = row.cik
            df_files["accessionNumber"] = row.accessionNumber
            
            cache_obj = f"{cache_path}/{row.cik_str}_{row.accessionNumber.replace('-','')}_files.parquet"
            wr.s3.to_parquet(
                df=df_files,
                path=cache_obj,
                boto3_session=boto3_session
            )
        
        time.sleep(0.1)

In [26]:
df_mining_companies = sec_companies_by_sic(["1000","1040","1090","1400"])

In [27]:
df_mining_companies["cik_str"] = df_mining_companies.CIK.apply(cik_str)

In [71]:
cache_edgar_cik_submissions(
    df_mining_companies.cik_str.to_list(),
    user_agent=user_agent,
    cache_path="s3://usgs-geoarchive/sec_edgar",
    boto3_session=aws_session
)

# Mining Company Filing Registry

The bulk submissions data also contains a historical listing of all filings a company has made with the SEC since 1994. For our purposes, we're interested in what are called the 10-K Annual Reports since 2018 when the new rules went into place and we might start seeing tecnical reports submitted as exhibits. The submissions data does not include the information on the individual contents (files) within a given submission, so we need a two part process that first identifies the annual reports and then checks a separate data source for the accession of each annual report for the contents of the filing.

## 1) Identify and Register Annual Reports

From the Mining Company Registry, we have the necessary CIK identifiers to determine exactly which parts of the submissions data we need to examine for 10-K Annual Reports. As we build this into an automated process, we will be able to fully parallelize the operation with a microservice approach such that each individual company in the registry can go get "its" latest submissions data via the SEC EDGAR API, check for any new annual reports, and tee those up for processing. To start with, we need to go back through our now filtered set of primary company submission JSON documents, pull the filings, and select any 10-K Annual Reports that could have included S-K 1300 Technical Reports. This should only be filings since 2018 when the new rule was put in place, so we will concentrate on those.

Since we have to run this as a multi-part process that is essentially adding data together iteratively, we will treat the annual reports as another registry in our architecture. This will give us an accession identifier that we can use in the subsequent crawling process to go check for and retrieve any technical reports associated with the annual report filing and included in the archival accession. This dynamic also lends itself well to an automated data processing pipeline where we can send the company CIK identifier and accession number to a message queue when something needs to be checked, kicking off the next stage in the pipeline.

In [74]:
filings_cached = wr.s3.read_parquet(
    path="s3://usgs-geoarchive/sec_edgar/*_filings.parquet",
    boto3_session=aws_session
)

In [102]:
filings_cached["year"] = filings_cached.filingDate.apply(lambda x: int(x.split("-")[0]))
filings_cached["cik_str"] = filings_cached.cik.apply(lambda x: x.lstrip("0"))
filings_cached["file_manifest"] = filings_cached.apply(lambda x: f"https://www.sec.gov/Archives/edgar/data/{x.cik_str}/{x.accessionNumber.replace('-','')}/index.json", axis=1)

In [116]:
accession_file_manifest(
    df=filings_cached[(filings_cached.year > 2017) & (filings_cached.form.str.startswith("10-K"))],
    user_agent=user_agent,
    cache_path="s3://usgs-geoarchive/sec_edgar",
    boto3_session=aws_session
)

In [117]:
file_manifest = wr.s3.read_parquet(
    path="s3://usgs-geoarchive/sec_edgar/*_files.parquet",
    boto3_session=aws_session
)

I have to come back and document a bunch of things here, but I want to highlight one interesting example I found when looking through the full file manifest. I found one example of a submitted S-K 1300 Technical Report in HTML format we need to figure out what to do with. But here's a little snippet of code showing how easy it would be to extract tables from one of these things in that format. Obviously a lot of cleanup work and filtering to do to turn this into usable data, but it's structurally simpler than dealing with tables in PDFs for the most part.

In [122]:
r = requests.get("https://www.sec.gov/Archives/edgar/data/1448597/000139390522000073/augg_ex961.htm", headers={"User-Agent": user_agent})
tables_from_page = pd.read_html(io=io.BytesIO(r.content))

for table in tables_from_page:
    display(table.head())

    0                                                  1
0 NaN  S-K 1300 Technical Report Mineral Resource Est...

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 2 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

                                                  0   1
0                              1. Executive Summary   8
1  1.1 Location, Property Description and Ownership   8
2                    1.2 Geology and Mineralization   9
3     1.3 Exploration, Drilling, Sampling and QA/QC  10
4                                 1.3.1 Exploration  10

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 3 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

                                          0   1
0                      6.3 District Geology  62
1            6.4 Mineralization and Veining  63
2             6.4.1 Bullfrog Mineralization  63
3  6.4.2 Montgomery-Shoshone Mineralization  64
4              6.4.3 Bonanza Mineralization  66

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 4 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

                                       0      1
0            11.8 Estimation Methodology  126.0
1  11.9 Resource Estimate Classification  129.0
2                     11.10 Density Data  129.0
3                       11.11 Pit Slopes  130.0
4                       11.12 Reblocking  133.0

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 5 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

                                                   0     1
0             Table 5-1: Bullfrog Project Production  54.0
1                 Table 7-1: Drilling Totals by Type  70.0
2                Table 7-2: Active Years by Operator  71.0
3  Table 7-3: Location and Depth of 2020 - 2021 H...  73.0
4  Table 7-4: Drilling Results from the 2020 - 20...  77.0

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 6 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

                                                   0   1
0    Figure 4-1: Photo of Bullfrog Hills at Rhyolite  52
1  Figure 6-1: Regional Setting of the Bullfrog M...  55
2  Figure 6-2: Bullfrog District - Stratigraphy a...  57
3  Figure 6-3: Cross Section of the Bullfrog Proj...  58
4  Figure 6-4: District Geology Map - Each Sectio...  63

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 7 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 8 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 9 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 10 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2,3,4,5,6
0,NaN,Total Drilling,Total Drilling,Coring,Coring,Reverse Circulation,Reverse Circulation
1,Year,Holes,Meters,Holes,Meters,Holes,Meters
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,1983,6,975,6,975,0,0
4,1984,37,3560,NaN,0,37,3560

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 11 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 12 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

                         0          1               2                3
0                      NaN     Bottle          Column           Column
1  Size, mesh, & mm (inch)  -100 mesh  -38 mm (-1.5”)  -9.5 mm (-3/8”)
2       Calc. Head, opt Au      0.029           0.035            0.029
3                    Rec %       96.6            71.4             75.9
4         Leach time, days        2.0              41               41

                    0             1                   2
0                 NaN  BF Low-Grade  M-S Mineralization
1  Calc. Head, opt Au         0.019               0.048
2  Calc. Head, opt Ag         0.108               0.380
3  Projected Au Rec %            67                  74
4  Projected Ag Rec %             9                  32

                 0             1            2        3               4
0        Feed Size  Crush Method         Test     Time  Au Recovery, %
1     9.5mm (3/8”)  Conventional       Column  60 days              58
2     9.5mm (3/8”)  Conventional  Bottle Roll   4 days              59
3  1.7mm (10 mesh)          HPGR       Column  60 days              77
4  1.7mm (10 mesh)          HPGR  Bottle Roll   4 days              70

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 13 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

             0                1             2       3         4           5
0       Sample        Feed Size  Crush Method    Test      Time  Au Rec., %
1  Composite E     9.5mm (3/8”)  Conventional  Column  151 days          75
2  Composite E     6.3mm (1/4”)          HPGR  Column  122 days          77
3  Composite E  1.7mm (10 mesh)          HPGR  Column  102 days          89
4       MS-M-1     9.5mm (3/8”)  Conventional  Column  108 days          66

                    0                        1              2
0          Leach Size  80% - 9.5 mm (3/8 inch)  ROM Low Grade
1  Estimated Recovery                      70%            50%

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 14 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 15 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2,3,4,5
0,"Combined Global Resources as of December 31, 2...","Combined Global Resources as of December 31, 2...","Combined Global Resources as of December 31, 2...","Combined Global Resources as of December 31, 2...","Combined Global Resources as of December 31, 2...","Combined Global Resources as of December 31, 2..."
1,Classification,Tonnes (Mt),Au grade (g/t),Ag grade (g/t),Au Contained (koz),Ag Contained (koz)
2,Measured,30.13,0.544,1.35,526.68,1309.13
3,Indicated,40.88,0.519,1.18,682.61,1557.49
4,Measured and Indicated,71.01,0.530,1.26,1209.29,2866.62

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 16 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2,3,4,5,6
0,"Mineral Resources as of December 31, 2021 - Bu...","Mineral Resources as of December 31, 2021 - Bu...","Mineral Resources as of December 31, 2021 - Bu...","Mineral Resources as of December 31, 2021 - Bu...","Mineral Resources as of December 31, 2021 - Bu...","Mineral Resources as of December 31, 2021 - Bu...","Mineral Resources as of December 31, 2021 - Bu..."
1,Redox,Classification,Tonnes (Mt),Au grade (g/t),Ag grade (g/t),Au Contained (koz),Ag Contained (koz)
2,Oxide,Measured,24.50,0.537,1.28,422.77,1010.02
3,Oxide,Indicated,36.32,0.515,1.14,602.02,1332.18
4,Oxide,Measured and Indicated,60.82,0.524,1.20,1024.79,2342.20

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 17 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2,3,4,5,6
0,"Mineral Resources as of December 31, 2021 - Mo...","Mineral Resources as of December 31, 2021 - Mo...","Mineral Resources as of December 31, 2021 - Mo...","Mineral Resources as of December 31, 2021 - Mo...","Mineral Resources as of December 31, 2021 - Mo...","Mineral Resources as of December 31, 2021 - Mo...","Mineral Resources as of December 31, 2021 - Mo..."
1,Redox,Classification,Tonnes (Mt),Au grade (g/t),Ag grade (g/t),Au Contained (koz),Ag Contained (koz)
2,Oxide,Measured,1.97,0.637,3.35,40.35,212.12
3,Oxide,Indicated,1.35,0.555,2.85,24.04,123.66
4,Oxide,Measured and Indicated,3.32,0.603,3.15,64.38,335.78

,0,1,2,3,4,5,6
0,"Mineral Resources as of December 31, 2021 - Bo...","Mineral Resources as of December 31, 2021 - Bo...","Mineral Resources as of December 31, 2021 - Bo...","Mineral Resources as of December 31, 2021 - Bo...","Mineral Resources as of December 31, 2021 - Bo...","Mineral Resources as of December 31, 2021 - Bo...","Mineral Resources as of December 31, 2021 - Bo..."
1,Redox,Classification,Tonnes (Mt),Au grade (g/t),Ag grade (g/t),Au Contained (koz),Ag Contained (koz)
2,Oxide,Measured,2.35,0.446,0.44,33.78,33.48
3,Oxide,Indicated,1.22,0.422,0.44,16.61,17.17
4,Oxide,Measured and Indicated,3.58,0.438,0.44,50.40,50.65

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 18 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 19 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 20 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

              0                  1
0  Abbreviation       Unit or Term
1            2D    two-dimensional
2            3D  three-dimensional
3            Ag             silver
4            Au               gold

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 21 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 22 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 23 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

                                    0                                   1
0  Augusta Gold Corp. Patented Claims  Augusta Gold Corp. Patented Claims
1                         Patent Name                  Mineral Survey No.
2                            Amathyst                                2629
3  Augusta Gold Corp. Patented Claims  Augusta Gold Corp. Patented Claims
4                       Standard Gold                       Standard Gold

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 24 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

                 0     1
0  Molly Gibson #4  3043
1  Molly Gibson #5  3043
2             Rand  2784
3          Rand #1  2784
4          Rand #2  2784

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 25 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

         0           1
0  BFGC 23  NMC1147872
1  BFGC 24  NMC1147873
2  BFGC 25  NMC1147874
3  BFGC 26  NMC1147875
4  BFGC 27  NMC1147876

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 26 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

         0           1
0  BFGC 60  NMC1147909
1  BFGC 61  NMC1147910
2  BFGC 62  NMC1147911
3   BFGC 7  NMC1154057
4  BFGC 63  NMC1154058

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 27 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

          0           1
0   BFGC 96  NMC1177616
1   BFGC 97  NMC1177617
2   BFGC 98  NMC1177618
3   BFGC 99  NMC1177619
4  BFGC 100  NMC1177620

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 28 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

                0           1
0        BFGC 131  NMC1185299
1        BFGC 132  NMC1185300
2        BFGC 133  NMC1185301
3        BFGC 134  NMC1185302
4  BEATTY CON # 1   NMC109662

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 29 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

        0          1
0  BVD 40  NMC987989
1  BVD 32  NMC987990
2  BVD 31  NMC987991
3  BVD 30  NMC987992
4  BVD 29  NMC987993

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 30 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

         0          1
0    BVD 2  NMC988025
1    BVD 1  NMC988026
2  BVD 401  NMC992989
3  BVD 402  NMC992990
4  BVD 403  NMC992991

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 31 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

       0        1
0  AR 18  1209036
1  AR 19  1209037
2  AR 20  1209038
3  AR 21  1209039
4  AR 22  1209040

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 32 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

               0         1
0    TRAMP NO. 1   46171.0
1           HOBO   45253.0
2       VIRGINIA  529024.0
3  DIAMOND HITCH   46187.0
4          COMET   46182.0

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 33 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

                                      0                                     1
0                         NEVADA PLACER                                952102
1                         PARIAN PLACER                                952102
2  Augusta Gold Corp. Unpatented Claims  Augusta Gold Corp. Unpatented Claims
3                        Barrick Claims                        Barrick Claims
4                           Mine Claims                           Mine Claims

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 34 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

          0           1
0  BEV # 43  NMC 350754
1  BEV # 44  NMC 350755
2  BEV # 45  NMC 350756
3  BEV # 46  NMC 350757
4  BEV # 53  NMC 350764

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 35 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

                0           1
0      BEV NO. 67  NMC 507288
1  LITTLE BEV # 9  NMC 523201
2       BROTHER 1  NMC 551789
3       BROTHER 2  NMC 551790
4  GOLDEN AGE # 6  NMC 583381

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 36 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

             0           1
0  BFMS NO. 22  NMC 519954
1  BFMS NO. 23  NMC 519955
2  BFMS NO. 24  NMC 519956
3  BFMS NO. 25  NMC 519957
4  BFMS NO. 26  NMC 519958

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 37 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

             0           1
0      BFMS 72  NMC 528591
1  BFMS NO. 73  NMC 528592
2  BFMS NO. 92  NMC 528611
3  BFMS NO. 93  NMC 528612
4  BFMS NO. 94  NMC 528613

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 38 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

                                      0                                     1
0  Augusta Gold Corp. Unpatented Claims  Augusta Gold Corp. Unpatented Claims
1                  Sawtooth Mtn. Claims                  Sawtooth Mtn. Claims
2                            Claim Name                     BLM Serial Number
3                               AUG 001                           NV105253630
4                               AUG 002                           NV105253631

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 39 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

         0            1
0  AUG 037  NV105253666
1  AUG 038  NV105253667
2  AUG 039  NV105253668
3  AUG 040  NV105253669
4  AUG 041  NV105253670

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 40 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

         0            1
0  AUG 076  NV105253705
1  AUG 077  NV105253706
2  AUG 078  NV105253707
3  AUG 079  NV105253708
4  AUG 080  NV105253709

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 41 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

         0            1
0  AUG 115  NV105253744
1  AUG 116  NV105253745
2  AUG 117  NV105253746
3  AUG 118  NV105253747
4  AUG 119  NV105253748

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 42 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

         0            1
0  AUG 154  NV105253783
1  AUG 155  NV105253784
2  AUG 156  NV105253785
3  AUG 157  NV105253786
4  AUG 158  NV105253787

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 43 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

         0            1
0  AUG 194  NV105270067
1  AUG 195  NV105270068
2  AUG 196  NV105270069
3  AUG 197  NV105270070
4  AUG 198  NV105270071

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 44 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

         0            1
0  AUG 233  NV105270106
1  AUG 234  NV105270107
2  AUG 235  NV105270108
3  AUG 236  NV105270109
4  AUG 237  NV105270110

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 45 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

         0            1
0  AUG 273  NV105270146
1  AUG 274  NV105270147
2  AUG 275  NV105270148
3  AUG 276  NV105270149
4  AUG 277  NV105270150

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 46 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 47 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 48 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 49 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 50 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

                                   0                                  1
0                Notification/Permit                             Agency
1                      Mine Registry        Nevada Division of Minerals
2          Mine Opening Notification           State Inspector of Mines
3               Solid Waste Landfill  Nevada Bureau of Waste Management
4  Hazardous Waste Management Permit  Nevada Bureau of Waste Management

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 51 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 52 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 53 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2,3,4,5
0,Year,Mined Tons,Gold Rec. OPT,Gold Rec. Oz,Silver Rec. Oz,Source Report
1,1989,1025000,0.060,56771,35752,Bond Gold
2,1990,3036000,0.080,220192,228647,Bond Gold
3,1991,2988000,0.073,198863,188824,Lac Min.
4,1992,3173000,0.111,323825,313100,Lac Min.

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 54 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 55 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 56 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 57 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 58 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 59 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 60 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 61 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 62 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 63 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 64 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 65 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 66 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 67 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 68 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 69 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2,3,4,5,6
0,Year,Total Drilling,Total Drilling,Coring,Coring,Reverse Circulation,Reverse Circulation
1,Year,Holes,Meters,Holes,Meters,Holes,Meters
2,1983,6,975,6,975,0,0
3,1984,37,3560,NaN,0,37,3560
4,1985,3,303,NaN,0,3,303

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 70 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

                         0                               1
0                 Operator                    Years Active
1         St. Joe American         August 1983 - July 1987
2  Bond International Gold       July 1987 - November 1989
3             Lac Minerals  November 1989 - September 1994
4    Barrick Bullfrog Inc.           September 1994 - 1999

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 71 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 72 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

         0        1         2          3        4    5            6
0  Hole ID  Easting  Northing  Elevation  Azimuth  Dip  Total Depth
1  BM-20-1    10040      9995       1117      135  -70        68.58
2  BM-20-2     9979      9967       1120      100  -57        89.92
3  BM-20-3     9823      9868       1139      130  -53        120.4
4  BH-20-4     9450      8910       1143       90  -60       190.49

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 73 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

            0        1         2          3        4    5            6
0     Hole ID  Easting  Northing  Elevation  Azimuth  Dip  Total Depth
1  BFG21-MS05    10139     10142       1226      114  -60       648.61
2  BFG21-MS06     9954      9632       1270      115  -45       449.88
3  BFG21-MS07    10139     10142       1226      114  -85       558.09
4  BFG21-MS08     9936      9581       1273      115  -65       432.21

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 74 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 75 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 76 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2,3,4,5,6
0,Hole ID,Interval in meters,Interval in meters,Interval in meters,Au,Ag,Zone
1,Hole ID,From,To,Length,g/t,g/t,Zone
2,BM-20-1,0,41,41,0.42,2.26,MS Vein Zone
3,includes,0,23,23,0.55,1.95,MS Vein Zone
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 77 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2,3,4,5,6
0,Hole ID,Interval in meters,Interval in meters,Interval in meters,Au,Ag,Zone
1,Hole ID,From,To,Length,g/t,g/t,Zone
2,BH-20-10,41,55,14,2.42,2.19,Mystery Hills
3,includes,41,47,6,4.89,4.14,Mystery Hills
4,BH-20-10,104,110,6,0.58,0.26,Mystery Hills

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 78 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2,3,4,5,6
0,Hole ID,Interval in meters,Interval in meters,Interval in meters,Au,Ag,Zone
1,Hole ID,From,To,Length,g/t,g/t,Zone
2,BH-20-19,0,35,35,0.44,0.3,Mystery Hills
3,includes,2,17,15,0.64,0.31,Mystery Hills
4,BH-20-19,43,59,17,0.27,0.25,Mystery Hills

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 79 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2,3,4,5,6
0,Hole ID,Interval in meters,Interval in meters,Interval in meters,Au,Ag,Zone
1,Hole ID,From,To,Length,g/t,g/t,Zone
2,BFG21-MS09,81.82,109.12,27.30,0.42,5.03,Polaris Vein
3,including,93.88,98.50,4.62,1.10,13.22,Polaris Vein
4,BFG21-MS09,133.50,141.07,7.57,0.19,0.94,Polaris Vein

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 80 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2,3,4,5,6
0,Hole ID,Interval in meters,Interval in meters,Interval in meters,Au,Ag,Zone
1,Hole ID,From,To,Length,g/t,g/t,Zone
2,BFG21-MS18,0.00,51.82,51.82,0.33,2.02,MS Vein Zone
3,including,0.00,4.57,4.57,0.73,3.29,MS Vein Zone
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 81 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

             0        1         2          3        4    5            6
0      Hole ID  Easting  Northing  Elevation  Azimuth  Dip  Total Depth
1   BFG21-MH25     9438      8908       1142       90  -70        419.1
2  *BFG21-IS26    11782     12882       1189       90  -45        470.9
3   BFG21-MS27     9947     10101       1224      155  -60        380.4
4   BFG21-MH28     9437      8908       1142       90  -85        353.3

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 82 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2,3,4,5,6
0,Hole ID,Interval in meters,Interval in meters,Interval in meters,Au,Ag,Zone
1,Hole ID,From,To,Length,g/t,g/t,Zone
2,BFG21-MH25,80.40,175.20,94.80,0.27,0.44,BF Vein
3,BFG21-MH25,236.17,242.25,6.08,0.61,2.42,Mystery Hills
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 83 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2,3,4,5,6
0,Hole ID,Interval in meters,Interval in meters,Interval in meters,Au,Ag,Zone
1,Hole ID,From,To,Length,g/t,g/t,Zone
2,BFG21-IS30,NSV,NaN,NaN,NaN,NaN,Indian Springs South
3,BFG21-IS33,NSV,NaN,NaN,NaN,NaN,Indian Springs South
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 84 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2,3,4,5,6
0,Hole ID,Interval in meters,Interval in meters,Interval in meters,Au,Ag,Zone
1,Hole ID,From,To,Length,g/t,g/t,Zone
2,BFG21-BF42,129.13,140.40,11.27,0.82,17.38,BF Hanging Wall
3,BFG21-BF42,163.21,176.17,12.96,0.21,0.23,BF Hanging Wall
4,BFG21-BF42,232.56,329.78,97.22,0.41,2.45,BF Hanging Wall

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 85 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 86 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

         0         1                   2
0      CRM  Au (ppm)            Ag (ppm)
1  A 74383      4.93                47.6
2  B 74110     0.237  No certified value
3  C 73909     0.778  No certified value

,0,1,2,3,4,5,6,7,8
0,RM,N,Outliers Excluded,Failures Excluded,Au ppm,Au ppm,Observed Au ppm,Observed Au ppm,Percent of Accepted
1,RM,N,Outliers Excluded,Failures Excluded,Accepted,Std. Dev.,Average,Std. Dev.,Percent of Accepted
2,C 73909,8,-,-,0.778,0.023,0.775,0.018,99.6%
3,B 74110,8,-,-,0.237,0.009,0.240,0.005,101.2%
4,A 74383,7,1,-,4.930,0.080,4.913,0.074,99.7%

,0,1,2,3,4,5,6,7,8
0,RM,N,Outliers Excluded,Failures Excluded,Ag ppm,Ag ppm,Observed Ag ppm,Observed Ag ppm,Percent of Accepted
1,RM,N,Outliers Excluded,Failures Excluded,Accepted,Std. Dev.,Average,Std. Dev.,Percent of Accepted
2,A 74383,4,1,3,47.600,1.200,45.329,0.878,95.2%
3,Total,4,NaN,NaN,NaN,NaN,NaN,Weighted Average,95.2%

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 87 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

             0           1             2
0        Blank  Gold (ppm)  Silver (ppm)
1  Blank (ASL)        0.03             2

,0,1,2
0,NaN,NaN,% of Sample Pairs (>10x d.l.) Reporting Within
1,Analyte,# of Pairs above 10x d.l.,±5
2,Au,75,100%
3,Ag,3,100%

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 88 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 89 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 90 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 91 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 92 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 93 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 94 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 95 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

            0           1             2
0         CRM  Gold (ppm)  Silver (ppm)
1   OREAS-250       0.309         0.258
2  OREAS-250b       0.332         0.073
3   OREAS-253        1.22             -

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 96 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2,3,4,5,6,7,8
0,RM,N,Outliers Excluded,Failures Excluded,Au ppm,Au ppm,Observed Au ppm,Observed Au ppm,Percent of Accepted
1,RM,N,Outliers Excluded,Failures Excluded,Accepted,Std. Dev.,Average,Std. Dev.,Percent of Accepted
2,OREAS-253,110,-,2,1.220,0.045,1.236,0.041,101.3%
3,OREAS-250b,12,-,1,0.332,0.011,0.322,0.012,96.9%
4,OREAS-250,94,-,2,0.309,0.013,0.320,0.013,103.7%

       0           1             2
0  Blank  Gold (ppm)  Silver (ppm)
1  Blank        0.03             2

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 97 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 98 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 99 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 100 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

               0   1                   2                    3              4
0          Grade   N  # with Paragon>SGS  # with Paragon <SGS  Average Bias*
1  0.1 - 0.5 g/t  30                  17                   13              6
2       >0.5 g/t  80                  56                   24             19

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 101 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 102 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

                 0               1
0    Gold Recovery             91%
1  Silver Recovery             65%
2       Leach Time        48 hours
3            Grind   80% -150 mesh
4  Rod Consumption  2.3 lbs/ tonne

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 103 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

                         0          1               2                3
0                      NaN     Bottle          Column           Column
1  Size, mesh, & mm (inch)  -100 mesh  -38 mm (-1.5”)  -9.5 mm (-3/8”)
2       Calc. Head, opt Au      0.029           0.035            0.029
3                    Rec %       96.6            71.4             75.9
4         Leach time, days        2.0              41               41

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 104 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

                    0             1                   2
0                 NaN  BF Low-Grade  M-S Mineralization
1  Calc. Head, opt Au         0.019               0.048
2  Calc. Head, opt Ag         0.108               0.380
3  Projected Au Rec %            67                  74
4  Projected Ag Rec %             9                  32

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 105 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

                 0             1            2        3               4
0        Feed Size  Crush Method         Test     Time  Au Recovery, %
1     9.5mm (3/8”)  Conventional       Column  60 days              58
2     9.5mm (3/8”)  Conventional  Bottle Roll   4 days              59
3  1.7mm (10 mesh)          HPGR       Column  60 days              77
4  1.7mm (10 mesh)          HPGR  Bottle Roll   4 days              70

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 106 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

             0                1             2       3         4           5
0       Sample        Feed Size  Crush Method    Test      Time  Au Rec., %
1  Composite E     9.5mm (3/8”)  Conventional  Column  151 days          75
2  Composite E     6.3mm (1/4”)          HPGR  Column  122 days          77
3  Composite E  1.7mm (10 mesh)          HPGR  Column  102 days          89
4       MS-M-1     9.5mm (3/8”)  Conventional  Column  108 days          66

                    0                        1              2
0          Leach Size  80% - 9.5 mm (3/8 inch)  ROM Low Grade
1  Estimated Recovery                      70%            50%

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 107 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 108 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2,3,4,5,6,7,8
0,Composite,Drillhole,NaN,NaN,NaN,NaN,NaN,REAGENT REQUIREMENTS,REAGENT REQUIREMENTS
1,Composite,Drillhole,Interval (ft),Interval (ft),Au Rec.,Head Grade Au g/tonne,Head Grade Au g/tonne,kg/tonne mineralized material,kg/tonne mineralized material
2,Composite,Drillhole,From,To,%,Calculated,Assayed,NaCN Cons.,Lime Added
3,4594-001,BM-20-1,0,40,67.8,0.59,0.80,0.15,1.1
4,4594-002,BM-50-1,40,75,67.2,0.58,0.50,0.11,1.2

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 109 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 110 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2,3,4,5
0,"Combined Global Resources as of December 31, 2...","Combined Global Resources as of December 31, 2...","Combined Global Resources as of December 31, 2...","Combined Global Resources as of December 31, 2...","Combined Global Resources as of December 31, 2...","Combined Global Resources as of December 31, 2..."
1,Classification,Tonnes (Mt),Au grade (g/t),Ag grade (g/t),Au Contained (koz),Ag Contained (koz)
2,Measured,30.13,0.544,1.35,526.68,1309.13
3,Indicated,40.88,0.519,1.18,682.61,1557.49
4,Measured and Indicated,71.01,0.530,1.26,1209.29,2866.62

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 111 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2,3,4,5,6
0,"Mineral Resources as of December 31, 2021 - Bu...","Mineral Resources as of December 31, 2021 - Bu...","Mineral Resources as of December 31, 2021 - Bu...","Mineral Resources as of December 31, 2021 - Bu...","Mineral Resources as of December 31, 2021 - Bu...","Mineral Resources as of December 31, 2021 - Bu...","Mineral Resources as of December 31, 2021 - Bu..."
1,Redox,Classification,Tonnes (Mt),Au grade (g/t),Ag grade (g/t),Au Contained (koz),Ag Contained (koz)
2,Oxide,Measured,24.50,0.537,1.28,422.77,1010.02
3,Oxide,Indicated,36.32,0.515,1.14,602.02,1332.18
4,Oxide,Measured and Indicated,60.82,0.524,1.20,1024.79,2342.20

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 112 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2,3,4,5,6
0,"Mineral Resources as of December 31, 2021 - Mo...","Mineral Resources as of December 31, 2021 - Mo...","Mineral Resources as of December 31, 2021 - Mo...","Mineral Resources as of December 31, 2021 - Mo...","Mineral Resources as of December 31, 2021 - Mo...","Mineral Resources as of December 31, 2021 - Mo...","Mineral Resources as of December 31, 2021 - Mo..."
1,Redox,Classification,Tonnes (Mt),Au grade (g/t),Ag grade (g/t),Au Contained (koz),Ag Contained (koz)
2,Oxide,Measured,1.97,0.637,3.35,40.35,212.12
3,Oxide,Indicated,1.35,0.555,2.85,24.04,123.66
4,Oxide,Measured and Indicated,3.32,0.603,3.15,64.38,335.78

,0,1,2,3,4,5,6
0,"Mineral Resources as of December 31, 2021 - Bo...","Mineral Resources as of December 31, 2021 - Bo...","Mineral Resources as of December 31, 2021 - Bo...","Mineral Resources as of December 31, 2021 - Bo...","Mineral Resources as of December 31, 2021 - Bo...","Mineral Resources as of December 31, 2021 - Bo...","Mineral Resources as of December 31, 2021 - Bo..."
1,Redox,Classification,Tonnes (Mt),Au grade (g/t),Ag grade (g/t),Au Contained (koz),Ag Contained (koz)
2,Oxide,Measured,2.35,0.446,0.44,33.78,33.48
3,Oxide,Indicated,1.22,0.422,0.44,16.61,17.17
4,Oxide,Measured and Indicated,3.58,0.438,0.44,50.40,50.65

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 113 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 114 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 115 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 116 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 117 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 118 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2,3
0,DOMAIN Code,Area,Triangulation Name,Description
1,10,Bullfrog,Modlim_BF.00t,Background
2,11,Bullfrog,AU_GPT_INDICATOR_0_18_BULLFROG_trim.00t,Low Grade Shell
3,12,Bullfrog,GM_RESDOMS_-_BF_MAIN_PART1.00t,Vein Shape
4,20,Montgomery-Shoshone,Modlim_MS.00t,Background

,0,1,2,3,4,5,6,7,8
0,DOMAIN,Au Min (g/t),Au Max (g/t),Au Avg (g/t),Au Cap Value,Percentile (%),Total GT Lost (%),CV (capped),Samples Capped
1,10,0.000,23.800,0.074,11.000,99.94,3.36,4.67,4
2,11,0.000,141.748,0.534,12.500,99.77,5.87,1.87,40
3,12,0.000,135.000,4.387,60.000,99.65,2.78,1.58,12
4,20,0.000,7.080,0.040,1.900,99.85,2.84,1.89,6

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 119 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2,3,4,5,6,7,8
0,DOMAIN,Ag Min (g/t),Ag Max (g/t),Ag Avg (g/t),Ag Cap Value,Percentile (%),Total GT Lost (%),CV (capped),Samples Capped
1,10,0.000,180.000,0.352,13.000,99.83,6.75,1.89,36
2,11,0.000,179.000,1.325,30.000,99.79,2.96,1.64,41
3,12,0.000,503.203,7.911,100.000,99.60,5.03,1.43,13
4,20,0.000,100.000,0.349,10.000,98.90,12.17,1.35,36

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 120 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 121 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 122 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 123 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 124 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

                      0              1                         2             3
0                   NaN  Bullfrog (BF)  Montgomery-Shoshone (MS)  Bonanza (BZ)
1   Minimum Easting (m)           8695                      9150          7100
2   Maximum Easting (m)           9901                     10806          8000
3  Minimum Northing (m)           7280                      9250          7700
4  Maximum Northing (m)           9323                     10753          8807

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 125 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 126 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2,3,4,5,6,7,8,9,10,11
0,Area,Pass,Domain,Bearing,Dip,Plunge,Major Axis (m),Semi-Major Axis (m),Minor Axis (m),Max Samples/DH,Samples Min,Samples Max
1,BF,1,11 - LG,170,-45,0,10,10,10,3,9,2
2,BF,2,11 - LG,170,-45,0,50,50,20,6,18,3
3,BF,3,11 - LG,170,-45,0,75,75,20,6,18,3
4,BF,4,11 - LG,170,-45,0,100,100,30,6,18,3

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 127 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 128 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2,3
0,NaN,Distance to Nearest Composite,Number of Drillholes used in Estimate,Classification Assignment
1,Measured,<= 15 meters,>= 3 drillholes,CATEG = 1
2,Indicated,<= 50 meters,>= 3 drillholes,CATEG = 2
3,Inferred,<= 75 meters,>= 2 drillholes,CATEG = 3

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 129 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

                  0                   1              2
0  Mineralized Rock                 NaN            NaN
1              Area  Mineralized Domain  SG Assignment
2                BF      Low Grade (11)           2.52
3                BF           Vein (12)           2.71
4                MS      Low Grade (21)           2.52

,0,1,2,3
0,Unmineralized Rock,NaN,NaN,NaN
1,Area,Unmineralized DOMAIN,Lithology (LITH),SG Assignment (SG)
2,"BF, MS & BZ","Unmineralized (10, 20, 30)","1, 2",2.38
3,"BF, MS & BZ","Unmineralized (10, 20, 30)","3, 4, 5, 6",2.36
4,"BF, MS & BZ","Unmineralized (10, 20, 30)",7,2.25

                     0                            1              2
0  Special Assignments                          NaN            NaN
1                 Area                  Description  SG Assignment
2          BF, MS & BZ                   Waste Dump           2.05
3          BF, MS & BZ                 Pit Backfill           2.05
4          BF, MS & BZ  UG Stope Backfill/Pastefill           2.00

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 130 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 131 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 132 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

                                            0        1          2
0                                  Parameter:    Input       Unit
1                                  Gold Price  1550.00     US$/oz
2                                Silver Price    20.00     US$/oz
3                                         NaN      NaN        NaN
4  Mining Cost Mineralized Material and Waste     2.25  US$/tonne

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 133 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 134 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 135 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 136 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 137 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 138 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

                                                  0           1
0                                              Task  Cost (USD)
1  Exploration/Delineation Drilling (11,000 meters)  $5,000,000
2                             Metallurgical Studies    $500,000
3             Preliminary Economic Assessment (PEA)    $250,000
4                                        Permitting  $2,000,000

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 139 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 140 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 141 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 142 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 143 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 144 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 145 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 146 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 147 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 148 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 149 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 150 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 151 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 152 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 153 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 154 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 155 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 156 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 157 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 158 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 159 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 160 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 161 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 162 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 163 of 164,March 2022

    0                   1
0 NaN  Augusta Gold Corp.
1 NaN                 NaN

,0,1,2
0,NaN,NaN,NaN
1,"FORTE DYNAMICS, INC 120 Commerce Drive., Units...",Page 164 of 164,March 2022

## 2) Identify and Register S-K 1300 Technical Reports

To find the technical reports, we have to get into the actual contents of the annual reports. This is another area where the SEC EDGAR system explicitly supports crawling operations. A given accession for a company is always stored in a URL path like the following:

https://www.sec.gov/Archives/edgar/data/{CIK identifier}/{accession identifier}

A helpful index.json document is available from this path, giving us the file contents contained within the accession folder. From the file contents listing, we can quickly determine if there are any technical reports included using what appears to be a consistent file naming convention that uses a code for these specific parts of a filing ("...ex96.{n}...pdf"). This alone would give us the PDFs we need, but we also need to consult an HTML page that provides a full list of the contents in the annual report including titles for the documents. These all appear to be in a standard format "Technical Report Summary of Mineral...for {x} Mine". This provides us with improved bibliographic metadata to start our records. We can use the title and parse the mine name for tagging.

Some of the technical reports and other contents in annual reports are filed in ammendments, which is a separate accession in the system. Within a given accession, technical reports are numbered sequentially with the "exhibit 96" identifier and additional seemingly unique identification in the file name. We'll need to explore this fully to make sure we understand the pattern.

# Building and Maintaining the GeoArchive Collection

Once we have our Mining Company Registry and Annual Report/Technical Report registry, we can use these together to assemble our online collection of these additional resources. We have decent enough bibliographic metadata to stub out usable records that will include titles, company names, mine name tags, and provenance information leading back to exactly where these records originated. We are lacking some things at this point to align more fully with a still notional target schema for this type of information:

* We could assume a date for the reports, probably based on the filing date of the annual report submission. There is a date modified on the file listing within the accession, but we have no way of knowing what this means in relation to the report.
* We don't have author information at this point. We might be able to work with the more standardized "consent of qualified persons" forms that are also a part of the submission contents to get these pulled together somehow, but that will take more investigation.
* We don't have a geographic location for the mines documented in the technical reports, but being able to pull mine names as distinct properties may help us correlate other information sources.

## To Store or Not to Store Technical Report Files?

Notionally, the SEC EDGAR system is reasonably stable and robust enough to be available for the long run. We may not need to store the actual PDF file content for the S-K 1300 reports. They should remain available within the SEC archives at the paths we can record in URL links from the bibliographic records. We should also be able to direct our partners with the xDD system on how to retrieve the documents from their source for processing as they will need to download and run them through the xDD pipelines. As we've done here, any other automated system will need to declare itself via a user-agent header.

We will reevaluate this once we start getting more engaged in doing things like annotating and marking up documents and then extracting that annotation for AI training data. That will push us into storing and working from copies of the PDF files on board with our online library. For now, we can use a link in the bibliographic record to facilitate access via the Zotero library, and we'll do some experimentation with how the Zotero client experience works with the links to make it as seamless as possible.

## Building the Zotero Group Library

Similar to the NI 43-101 Technical Reports, we've created a new group library for the [S-K 1300 Technical Reports](https://www.zotero.org/groups/4754160/s-k_1300_technical_reports/library). We use the geoarchive package here to populate the collection with our previously assembled bibliographic metadata that we've stashed on CHS.

This particular use case brings up an interesting dynamic where we may end up with a mixed situation in terms of where and from whom information for the collection is originating. We'll be putting an automated data processing pipeline in place to do all the things in this notebook, keeping up with new filings discovered from the SEC EDGAR system. From the point where these items get added to our GeoArchive collection, other activities may commence where group members are editing and improving bibliographic metadata, we may start annotating documents (prompting the need to store a copy), and we may build in feedbacks from xDD or other processors to add in tags or additional value-added information. Subsequently, even though we have a cloud-based instance of some of the metadata for this collection, we'll want to run the same process to routinely pull information from Zotero and store that in a different cloud data asset for both backup/future-proofing and other uses.

It appears that the API and the bulk data may not necessarily give us a pathway to pull the actual technical report files themselves. We can get to the level of identifying a mining company and finding the annual filing where S-K 1300 Technical Reports might be included as one of many "exhibits." We'd have to then find a way to crack open the filing and

In [ ]:
s = requests.Session()
s.headers['User-Agent'] = "U.S. Geological Survey;https://www.usgs.gov"

r = s.get("https://www.sec.gov/Archives/edgar/data/0001001838/000155837022002995/scco-20211231x10ka.htm")

sample_soup = BeautifulSoup(r.content, 'html.parser')

tables = sample_soup.findAll("table")

In [ ]:
for tr in tables[7].findAll("tr"):
    for td in tr.findAll("td"):
        print(td.text)